# ApplicableTotalLengthRounding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricRoundingManager..::..ApplicableTotalLengthRounding Property
FabricRoundingManager Class See Also
---
The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ApplicableTotalLengthRounding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableTotalLengthRounding As Double
	Get
```

Visual C++
---
```text
public:
property double ApplicableTotalLengthRounding {
	double get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true. ApplicableTotalLengthRounding is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
# See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace